AUTO_config_TK_pesok/src/InformationRegisters/ТК_ГрафикиИнвентаризаций/ТК_ГрафикиИнвентаризаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ГрафикиИнвентаризаций</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ХранилищеОтборов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаИнвентаризации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/CommonModules/ГрафикиСервер/Module.bsl
#Область ПроцедурыЗаписиДвиженийВРегистр


Процедура ОтразитьГрфикиИнвентаризаций(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_ГрафикиИнвентаризаций;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикиИнвентаризаций = Движения.ТК_ГрафикиИнвентаризаций;
	ГрафикиИнвентаризаций.Записывать = Истина;
	//
	ГрафикиИнвентаризаций.Загрузить(Таблица);
	
КонецПроцедуры //


#КонецОбласти


Процедура ПодготовитьТаблицуДвижений(Запрос, ДополнительныеСвойства)Экспорт
	
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	
	ТаблицыДокумента = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	ТаблицаДвижения = Новый ТаблицаЗначений;       
	ТаблицаДвижения.Колонки.Добавить("ДатаИнвентаризации",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	ТаблицаДвижения.Колонки.Добавить("ТорговаяПлощадка",Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
	ТаблицаДвижения.Колонки.Добавить("ХранилищеОтборов");
	Для Каждого СтрокаТаблицы Из ТаблицыДокумента.ТаблицаГрафикиИнвентаризаций Цикл 
		
		мСтроки = ТаблицыДокумента.ТаблицаОтборы.НайтиСтроки(Новый Структура("Ключ",СтрокаТаблицы.Ключ));
		
		ТаблицаОтборов = Новый ТаблицаЗначений;
		ТаблицаОтборов.Колонки.Добавить("ТипСклада",Новый ОписаниеТипов("СправочникСсылка.ВидыСкладов"));
		ТаблицаОтборов.Колонки.Добавить("Описание",ОбщегоНазначения.ОписаниеТипаСтрока(150));
		ТаблицаОтборов.Колонки.Добавить("ХранилищеЗначения",Новый ОписаниеТипов("ХранилищеЗначения"));
		Если мСтроки.Количество()= 0 Тогда
			
			Для Каждого стрОтборПоУмолчанию Из  ТаблицыДокумента.ТаблицаОтборыПоУмолчанию Цикл 
				нстрТаблицаДвижений = ТаблицаОтборов.Добавить();
				нстрТаблицаДвижений.Описание = стрОтборПоУмолчанию.Описание;
				нстрТаблицаДвижений.ТипСклада = стрОтборПоУмолчанию.ТипСклада;
				нстрТаблицаДвижений.ХранилищеЗначения = стрОтборПоУмолчанию.ХранилищеОтборов;

			КонецЦикла;
				
		Иначе
			Для Каждого стмСтроки Из мСтроки Цикл 
				нстрТаблицаДвижений = ТаблицаОтборов.Добавить();
				нстрТаблицаДвижений.Описание = стмСтроки.Описание;
				нстрТаблицаДвижений.ТипСклада = стмСтроки.ТипСклада;
				нстрТаблицаДвижений.ХранилищеЗначения = стмСтроки.ХранилищеОтборов;
			КонецЦикла;
		КонецЕсли;
		ХранилищеОтборов = Новый ХранилищеЗначения(ТаблицаОтборов,Новый СжатиеДанных(9));
		
		нстрТаблицаДвижений = ТаблицаДвижения.Добавить();
		нстрТаблицаДвижений.ДатаИнвентаризации = СтрокаТаблицы.Дата;
		нстрТаблицаДвижений.ТорговаяПлощадка = СтрокаТаблицы.ТорговаяПлощадка;
		
		нстрТаблицаДвижений.ХранилищеОтборов = ХранилищеОтборов;
	КонецЦикла;
	
	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТК_ГрафикиИнвентаризаций",ТаблицаДвижения);	

	
КонецПроцедуры
